Revit 2027 API
Category.IsBuiltInCategoryValid Method
 Checks if a Category exists for a given BuiltInCategory.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsBuiltInCategoryValid(
	BuiltInCategory builtInCategory
)
Public Shared Function IsBuiltInCategoryValid (
	builtInCategory As BuiltInCategory
) As Boolean
public:
static bool IsBuiltInCategoryValid(
	BuiltInCategory builtInCategory
)
static member IsBuiltInCategoryValid :
        builtInCategory : BuiltInCategory -> bool
Parameters
builtInCategory BuiltInCategory
 The BuiltInCategory to check.
Return Value
Boolean
Remarks
 Some BuiltInCategory values are obsolete and are kept for upgrade reasons. For those no Category exists.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace